# Join Practice

We will make use of the employee database for this assignment. You will get lots of practice with joins and natural joins. You only have to provide your answer in SQL, but you may find it useful to draw out the relational algebra to help you organize your thinking.

In [2]:
import warnings
warnings.filterwarnings('ignore')
from sols6 import *

In [3]:
%load_ext sql

In [4]:
%sql postgresql://aljamo01:@localhost/employees

'Connected: aljamo01@employees'

In [5]:
%%sql
SELECT *
From employees
LIMIT(1);

1 rows affected.

[(10001, datetime.date(1953, 9, 2), 'Georgi', 'Facello', 'M', datetime.date(1986, 6, 26))]

In [7]:
%%sql
SELECT *
From titles
LIMIT(5);

5 rows affected.

[(10001, 'Senior Engineer', datetime.date(1986, 6, 26), datetime.date(9999, 1, 1)),
 (10002, 'Staff', datetime.date(1996, 8, 3), datetime.date(9999, 1, 1)),
 (10003, 'Senior Engineer', datetime.date(1995, 12, 3), datetime.date(9999, 1, 1)),
 (10004, 'Engineer', datetime.date(1986, 12, 1), datetime.date(1995, 12, 1)),
 (10004, 'Senior Engineer', datetime.date(1995, 12, 1), datetime.date(9999, 1, 1))]

In [6]:
%%sql
SELECT *
From dept_emp
LIMIT(1);

1 rows affected.

[(10001, 'd005', datetime.date(1986, 6, 26), datetime.date(9999, 1, 1))]

In [57]:
%%sql
SELECT *
From departments
LIMIT(10);

9 rows affected.

[('d001', 'Marketing'),
 ('d002', 'Finance'),
 ('d003', 'Human Resources'),
 ('d004', 'Production'),
 ('d005', 'Development'),
 ('d006', 'Quality Management'),
 ('d007', 'Sales'),
 ('d008', 'Research'),
 ('d009', 'Customer Service')]

In [8]:
%%sql
SELECT *
From dept_manager
LIMIT(1);

1 rows affected.

[(110022, 'd001', datetime.date(1985, 1, 1), datetime.date(1991, 10, 1))]

In [9]:
%%sql
SELECT *
From salaries
LIMIT(1);

1 rows affected.

[(488137, 47466, datetime.date(1995, 9, 11), datetime.date(1996, 9, 10))]

In [13]:
%%sql
SELECT
FROM employees NATURAL JOIN dept_emp NATURAL JOIN departments
WHERE
ORDER BY

(psycopg2.ProgrammingError) syntax error at or near "FROM"
LINE 2: FROM
        ^
 [SQL: 'SELECT\nFROM\nWHERE']

### 1. List the first and last name and hire date of each current employee in the Sales Department hired before Feb 7, 1985 ordered by hire date earliest to latest.

In [58]:
%%sql

SELECT first_name, last_name, hire_date
FROM employees NATURAL JOIN dept_emp NATURAL JOIN departments
WHERE dept_name = 'Sales' and hire_date < '1985-02-07' and now() < to_date
ORDER BY hire_date

55 rows affected.

[('Przemyslawa', 'Kaelbling', datetime.date(1985, 1, 1)),
 ('Yongdong', 'Pileggi', datetime.date(1985, 2, 1)),
 ('Shir', 'Munck', datetime.date(1985, 2, 1)),
 ('Adil', 'Furedi', datetime.date(1985, 2, 1)),
 ('Chaosheng', 'Sommen', datetime.date(1985, 2, 2)),
 ('Guenter', 'Tanemo', datetime.date(1985, 2, 2)),
 ('Erzsebet', 'Schwartzbauer', datetime.date(1985, 2, 2)),
 ('Gay', 'Kumaresan', datetime.date(1985, 2, 2)),
 ('Limsoon', 'Macedo', datetime.date(1985, 2, 2)),
 ('Holgard', 'Pena', datetime.date(1985, 2, 2)),
 ('Xinglin', 'Marakhovsky', datetime.date(1985, 2, 2)),
 ('Kousuke', 'Swist', datetime.date(1985, 2, 2)),
 ('Chikako', 'Malabarba', datetime.date(1985, 2, 2)),
 ('Zita', 'Vural', datetime.date(1985, 2, 3)),
 ('Fumitaka', 'Boyle', datetime.date(1985, 2, 3)),
 ('Huan', 'Dahlbom', datetime.date(1985, 2, 3)),
 ('Mitchel', 'Gustavson', datetime.date(1985, 2, 3)),
 ('Godehard', 'Conte', datetime.date(1985, 2, 3)),
 ('Premsyl', 'Nitto', datetime.date(1985, 2, 3)),
 ('Halsur', 'Birrer', datetime.date(1985, 2, 3)),
 ('Chiranjit', 'Stemann', datetime.date(1985, 2, 3)),
 ('Nectarios', 'Perna', datetime.date(1985, 2, 3)),
 ('Fumiyo', 'Cronau', datetime.date(1985, 2, 3)),
 ('Shakhar', 'Sgarro', datetime.date(1985, 2, 3)),
 ('Stafford', 'Luce', datetime.date(1985, 2, 4)),
 ('Goa', 'Parfitt', datetime.date(1985, 2, 4)),
 ('Eberhardt', 'Pramanik', datetime.date(1985, 2, 4)),
 ('Khalid', 'Salinas', datetime.date(1985, 2, 4)),
 ('Tran', 'Jiang', datetime.date(1985, 2, 4)),
 ('Fox', 'Waschkowski', datetime.date(1985, 2, 4)),
 ('Xiong', 'Chenoweth', datetime.date(1985, 2, 4)),
 ('Arto', 'Argence', datetime.date(1985, 2, 4)),
 ('Limsoon', 'Bage', datetime.date(1985, 2, 5)),
 ('Goh', 'Linnainmaa', datetime.date(1985, 2, 5)),
 ('Chiranjit', 'Ghelli', datetime.date(1985, 2, 5)),
 ('Boutros', 'Velardi', datetime.date(1985, 2, 5)),
 ('Gregory', 'Griswold', datetime.date(1985, 2, 5)),
 ('Niteen', 'Matteis', datetime.date(1985, 2, 5)),
 ('Vasilis', 'Pettis', datetime.date(1985, 2, 5)),
 ('Rance', 'Chepyzhov', datetime.date(1985, 2, 5)),
 ('Jaques', 'Hashii', datetime.date(1985, 2, 5)),
 ('Goa', 'Swick', datetime.date(1985, 2, 5)),
 ('Ramalingam', 'Validov', datetime.date(1985, 2, 5)),
 ('Bedrich', 'Lubachevsky', datetime.date(1985, 2, 5)),
 ('Ohad', 'Srimani', datetime.date(1985, 2, 5)),
 ('Amalendu', 'Hiyoshi', datetime.date(1985, 2, 5)),
 ('Nakhoon', 'Falby', datetime.date(1985, 2, 6)),
 ('Adil', 'Uludag', datetime.date(1985, 2, 6)),
 ('Horward', 'Steenbeek', datetime.date(1985, 2, 6)),
 ('Pragnesh', 'Orlowska', datetime.date(1985, 2, 6)),
 ('Xiaoqiang', 'Ferriere', datetime.date(1985, 2, 6)),
 ('Noritoshi', 'Luff', datetime.date(1985, 2, 6)),
 ('Hugo', 'Griswold', datetime.date(1985, 2, 6)),
 ('Uriel', 'Daescu', datetime.date(1985, 2, 6)),
 ('Dhritiman', 'Masamoto', datetime.date(1985, 2, 6))]

In [59]:
join1_test(_)

Correct!

### 2. How many employees currently work for each department (order from smallest to largest)?

In [75]:
%%sql
SELECT dept_name, COUNT(*)
FROM employees NATURAL JOIN dept_emp NATURAL JOIN departments
WHERE now() < to_date
GROUP BY dept_name
ORDER BY COUNT(*);

9 rows affected.

[('Finance', 12437),
 ('Human Resources', 12898),
 ('Quality Management', 14546),
 ('Marketing', 14842),
 ('Research', 15441),
 ('Customer Service', 17569),
 ('Sales', 37701),
 ('Production', 53304),
 ('Development', 61386)]

In [63]:
join2_test(_)

Correct!

### 3.  How many current employees no longer work for the Sales department?

The answer should be a single row and column.

In [87]:
%%sql
SELECT COUNT(*)
FROM employees NATURAL JOIN dept_emp NATURAL JOIN departments 
WHERE dept_name = 'Sales' and now() > to_date

1 rows affected.

[(14544,)]

In [84]:
join3_test(_)

Correct!

### 4. For each deparment, of current department employees, find the hire date of the person that was most recently hired to the company.

In [68]:
%%sql
SELECT dept_name, max(hire_date)
FROM employees NATURAL JOIN dept_emp NATURAL JOIN departments
WHERE now() < to_date
GROUP BY dept_name

9 rows affected.

[('Research', datetime.date(1999, 12, 10)),
 ('Sales', datetime.date(1999, 12, 31)),
 ('Customer Service', datetime.date(1999, 12, 30)),
 ('Marketing', datetime.date(2000, 1, 4)),
 ('Human Resources', datetime.date(2000, 1, 13)),
 ('Production', datetime.date(2000, 1, 23)),
 ('Quality Management', datetime.date(1999, 12, 2)),
 ('Development', datetime.date(2000, 1, 22)),
 ('Finance', datetime.date(2000, 1, 6))]

In [69]:
join4_test(_)

Correct!

### 5. List names of all of the managers and their starting and ending dates who have managed the Customer Service department, order them from first to last.

In [35]:
%%sql
SELECT first_name, last_name, from_date, to_date
FROM employees NATURAL JOIN dept_manager NATURAL JOIN departments
WHERE dept_name = 'Customer Service'

4 rows affected.

[('Tonny', 'Butterworth', datetime.date(1985, 1, 1), datetime.date(1988, 10, 17)),
 ('Marjo', 'Giarratana', datetime.date(1988, 10, 17), datetime.date(1992, 9, 8)),
 ('Xiaobin', 'Spinelli', datetime.date(1992, 9, 8), datetime.date(1996, 1, 3)),
 ('Yuchang', 'Weedman', datetime.date(1996, 1, 3), datetime.date(9999, 1, 1))]

In [36]:
join5_test(_)

Correct!

### 6. Give the first name and last name and salary of the current 10 highest paid employees.

In [70]:
%%sql
SELECT first_name, last_name, salary
FROM employees NATURAL JOIN salaries
WHERE now() < to_date
ORDER BY salary DESC
LIMIT(10);

10 rows affected.

[('Tokuyasu', 'Pesch', 158220),
 ('Honesty', 'Mukaidono', 156286),
 ('Xiahua', 'Whitcomb', 155709),
 ('Sanjai', 'Luders', 155513),
 ('Tsutomu', 'Alameldin', 155190),
 ('Willard', 'Baca', 154459),
 ('Lidong', 'Meriste', 154376),
 ('Charmane', 'Griswold', 153715),
 ('Weijing', 'Chenoweth', 152710),
 ('Weicheng', 'Hatcliff', 152687)]

In [71]:
join6_test(_)

Correct!

### 7. Give the first name, last name, salary, and title of the current 10 highest paid employees.

In [44]:
%%sql
SELECT first_name, last_name, salary, title
FROM employees NATURAL JOIN salaries JOIN titles ON titles.emp_no=salaries.emp_no 
WHERE salaries.to_date = '9999-01-01' and titles.to_date = '9999-01-01'
ORDER BY salary DESC
LIMIT(10);

10 rows affected.

[('Tokuyasu', 'Pesch', 158220, 'Senior Staff'),
 ('Honesty', 'Mukaidono', 156286, 'Senior Staff'),
 ('Xiahua', 'Whitcomb', 155709, 'Senior Staff'),
 ('Sanjai', 'Luders', 155513, 'Senior Staff'),
 ('Tsutomu', 'Alameldin', 155190, 'Senior Staff'),
 ('Willard', 'Baca', 154459, 'Senior Staff'),
 ('Lidong', 'Meriste', 154376, 'Senior Staff'),
 ('Charmane', 'Griswold', 153715, 'Senior Staff'),
 ('Weijing', 'Chenoweth', 152710, 'Senior Staff'),
 ('Weicheng', 'Hatcliff', 152687, 'Senior Staff')]

In [45]:
join7_test(_)

Correct!

### 8. Give the first and last name, current salary, and department of the current 10 lowest paid employees.

In [47]:
%%sql
SELECT first_name, last_name, salary, dept_name
FROM employees NATURAL JOIN dept_emp NATURAL JOIN departments  JOIN salaries ON employees.emp_no=salaries.emp_no 
WHERE salaries.to_date = '9999-01-01'
ORDER BY salary
LIMIT(10);

10 rows affected.

[('Olivera', 'Baek', 38623, 'Production'),
 ('Pascal', 'Lueh', 38936, 'Human Resources'),
 ('Sachar', 'Nicolson', 38942, 'Quality Management'),
 ('Yurij', 'Narwekar', 39012, 'Finance'),
 ('Oldrich', 'Schmiedel', 39036, 'Development'),
 ('Gianluca', 'Talmor', 39117, 'Quality Management'),
 ('Marie', 'Marrakchi', 39186, 'Research'),
 ('Xiaopeng', 'Piancastelli', 39227, 'Human Resources'),
 ('Angus', 'Schlumberger', 39264, 'Research'),
 ('Vidar', 'Turnbull', 39285, 'Production')]

In [48]:
join8_test(_)

Correct!

### 9. What is the average salary of the current employees who are males and in the sales?

In [82]:
%%sql
SELECT to_char(avg(salary), '$999,999.99') to_char
FROM departments NATURAL JOIN dept_emp NATURAL JOIN employees join salaries on salaries.emp_no = employees.emp_no
WHERE gender = 'M' and dept_name = 'Sales' and now() < salaries.to_date

1 rows affected.

[('$  88,895.99',)]

In [79]:
join9_test(_)

Error! Line by line comparison shows that your query is invalid. Read the question carefully.
Your solution should be like the following table:
       to_char
0    88,864.20

AssertionError:

### 10. Show the number of males and females currently in each department.

The department names should be sorted and the count of females should be listed before the count of males for each department.

In [76]:
%%sql
SELECT dept_name, gender,count(gender)
FROM employees NATURAL JOIN dept_emp NATURAL JOIN departments
WHERE now() < to_date
GROUP BY dept_name, gender
ORDER BY dept_name, gender;

18 rows affected.

[('Customer Service', 'F', 7007),
 ('Customer Service', 'M', 10562),
 ('Development', 'F', 24533),
 ('Development', 'M', 36853),
 ('Finance', 'F', 5014),
 ('Finance', 'M', 7423),
 ('Human Resources', 'F', 5147),
 ('Human Resources', 'M', 7751),
 ('Marketing', 'F', 5864),
 ('Marketing', 'M', 8978),
 ('Production', 'F', 21393),
 ('Production', 'M', 31911),
 ('Quality Management', 'F', 5872),
 ('Quality Management', 'M', 8674),
 ('Research', 'F', 6181),
 ('Research', 'M', 9260),
 ('Sales', 'F', 14999),
 ('Sales', 'M', 22702)]

In [77]:
join10_test(_)

Correct!

## What is the average salary of the current employees who have the title Engineer and in the Development?

In [24]:
%%sql
SELECT to_char(avg(salary), '$999,999.99') to_char
FROM departments NATURAL JOIN dept_emp NATURAL JOIN titles join salaries on salaries.emp_no = titles.emp_no
WHERE title = 'Engineer' and dept_name = 'Development' and now() < salaries.to_date

1 rows affected.

[('$  57,701.56',)]

In [18]:
%%sql
SELECT COUNT(*)
FROM dept_manager NATURAL JOIN departments
WHERE dept_name = 'Customer Service' and '1980-01-01' < to_date

1 rows affected.

[(4,)]

In [20]:
%%sql
SELECT first_name, last_name, to_char(max(salary), '$999,999.99') to_char
FROM employees NATURAL JOIN salaries
WHERE now() < hire_date

(psycopg2.ProgrammingError) column "employees.first_name" must appear in the GROUP BY clause or be used in an aggregate function
LINE 1: SELECT first_name, last_name, to_char(max(salary), '$999,999...
               ^
 [SQL: "SELECT first_name, last_name, to_char(max(salary), '$999,999.99') to_char\nFROM employees NATURAL JOIN salaries\nWHERE now() < hire_date"]